export const HABIT_RECORD_COUNT = {
  MIN: 3,
  MAX: 20,
};

export const HABIT_COUNT = {
  MIN: 3,
  MAX: 10,
};

export const EMOJI_COUNT = {
  MIN: 1,
  MAX: 20,
}

export const TOTAL_POINT_LIMIT = {
  MIN: 1,
  MAX: 100,
}

export const SUBJECTS = [
  'HTML',
  'CSS',
  '자바스크립트',
  '모던 JS',
  '리액트',
  '데이터베이스',
  '프리즈마',
  'Git',
  'UI/UX',
  '풀스택',
  '프로그래밍',
];

export const INTRO_TEMPLATES = [
  `과목을 조금씩이라도 매일 공부하는 습관을 만들기 위한 공간입니다.`,
  `과목을 목표로 개인 학습 루틴을 관리하는 스터디입니다.`,
  `과목 공부 과정을 기록하고 스스로를 점검하기 위해 시작했어요.`,
  `과목을 중심으로 한 개인 공부 기록 공간입니다.`,
  `과목 공부를 꾸준히 이어가기 위해 만든 작은 스터디예요.`,

  `과목 학습 습관을 만들고, 응원을 통해 동기부여를 얻고 싶습니다.`,
  `과목 공부를 혼자 하지만, 함께하는 느낌을 얻고 싶어요.`,
  `공부를 매일 인증하며 꾸준함을 유지하려고 합니다.`,
  `혼자 공부하지만, 공개적으로 기록하며 동기부여를 얻고 싶어요.`,
  `저의 기록 과정을 보시면서 함께 공부해봐요.`,

  `학습 습관을 기록하고 매일 체크하기 위한 스터디예요.`,
  `학습 여부를 매일 체크하며 성취감을 쌓아가고 있습니다.`,
  `학습 과정을 공개적으로 기록하며 자극을 받고자 합니다.`,
  `공부 과정을 공유하고 응원을 통해 계속 이어가려 합니다.`,
  `저의 공부를 응원하고 싶으시다면 이모티콘을 남겨주세요.`,
];

export const EMOJI_TYPES = [
  // 응원
  '🔥', '💪', '👏', '🙌', '👍', '✨',
  '🎉', '🚀', '🌱', '⭐️',

  // 공부, 기록
  '📚', '✏️', '📝', '📖', '💻',

  // 성취, 완료
  '✅', '☑️', '🏆', '🥇',

  // 감정
  '😊', '😄', '😆', '🤩', '🥹',
];

export const HABITS = [
  '아침 물 마시기',
  '일정한 기상 시간',
  '하루 계획 세우기',
  '불필요한 알림 끄기',
  '스트레칭하기',
  '천천히 식사하기',
  '하루 산책',
  '잠들기 전 화면 끄기',
  '감사 기록하기',
  '독서하기',
  '중요한 일 먼저 하기',
  '메신저 확인 시간 제한',
  '자세 바로잡기',
  '물 자주 마시기',
  '물건 제자리에 두기',
  '깊게 호흡하기',
  '하루 회고하기',
  '지출 기록하기',
  '햇빛 쬐기',
  '채소 챙겨 먹기',
  '긍정적인 말하기',
  '운동 후 스트레칭',
  '미루지 않기',
  'SNS 사용 줄이기',
  '한 곳 정리하기',
  '수분 섭취 체크',
  '목표 달성 확인',
  '새로운 것 배우기',
  '내일 할 일 적기',
  '주간 목표 점검',
];